OpenNuvoton/NUC126BSP/SampleCode/StdDriver/USBD_Audio_NAU8822/usbd_audio.c
    i32Err = 0;
    
    g_u32I2cFlow = 1;
    /* Send START */
    I2C_START(I2C0);
    //I2C_WAIT_READY(I2C0);
    i32Err |= I2C_WaitReady(I2C0);

    if(i32Err == 0)
    {
        g_u32I2cFlow = 2;
        /* Send device address */
        I2C_SET_DATA(I2C0, 0x1A << 1);
        I2C_SET_CONTROL_REG(I2C0, I2C_CTL_SI);
        //I2C_WAIT_READY(I2C0);
        i32Err |= I2C_WaitReady(I2C0);
    }

    if(i32Err == 0)
    {
        g_u32I2cFlow = 3;
        /* Send register number and MSB of data */
        I2C_SET_DATA(I2C0, (uint8_t)((u8addr << 1) | (u16data >> 8)));
        I2C_SET_CONTROL_REG(I2C0, I2C_CTL_SI);
        //I2C_WAIT_READY(I2C0);
        i32Err |= I2C_WaitReady(I2C0);
    }
    
    if(i32Err == 0)
    {
        g_u32I2cFlow = 4;
        /* Send data */
        I2C_SET_DATA(I2C0, (uint8_t)(u16data & 0x00FF));
        I2C_SET_CONTROL_REG(I2C0, I2C_CTL_SI);
        //I2C_WAIT_READY(I2C0);
        i32Err |= I2C_WaitReady(I2C0);
    }
    
    g_u32I2cFlow = 5;
    /* Send STOP */
    I2C_STOP(I2C0);
    
    return i32Err;
}


void WAU8822_Setup(void)
{
    I2C_WriteWAU8822(0,  0x000);   /* Reset all registers */
    CLK_SysTickDelay(10000);

    I2C_WriteWAU8822(1,  0x0EF);
        
    I2C_WriteWAU8822(2,  0x1BF);   /* Enable L/R Headphone, ADC Mix/Boost, ADC */
    I2C_WriteWAU8822(3,  0x07F);   /* Enable L/R main mixer, DAC */
    I2C_WriteWAU8822(4,  0x010);   /* 16-bit word length, I2S format, Stereo */
    I2C_WriteWAU8822(5,  0x000);   /* Companding control and loop back mode (all disable) */

    if(g_u32Master == 1)
    {
        g_u32MasterSlave = SPII2S_MODE_MASTER;
        #if(PLAY_RATE == 48000)
            I2C_WriteWAU8822(6, 0x000);    /* Divide by 1, 48K */
            I2C_WriteWAU8822(7, 0x000);    /* 48K for internal filter cofficients */
        #elif(PLAY_RATE == 32000)
            I2C_WriteWAU8822(6, 0x020);    /* Divide by 1.5, 32K */
            I2C_WriteWAU8822(7, 0x002);    /* 32 for internal filter cofficients */
        #elif(PLAY_RATE == 16000)
            I2C_WriteWAU8822(6, 0x060);    /* Divide by 3, 16K */
            I2C_WriteWAU8822(7, 0x006);    /* 16K for internal filter cofficients */
        #else
            I2C_WriteWAU8822(6, 0x0A0);    /* Divide by 6, 8K */
            I2C_WriteWAU8822(7, 0x00A);    /* 8K for internal filter cofficients */
        #endif
    }
    else
    {
        g_u32MasterSlave = SPII2S_MODE_SLAVE;
        
        #if(PLAY_RATE == 48000)
            I2C_WriteWAU8822(6,  0x14D);   /* Divide by 2, 48K */
            I2C_WriteWAU8822(7,  0x000);   /* 48K for internal filter coefficients */
        #elif(PLAY_RATE == 32000)
            I2C_WriteWAU8822(6,  0x16D);   /* Divide by 3, 32K */
            I2C_WriteWAU8822(7,  0x002);   /* 32K for internal filter coefficients */
        #elif(PLAY_RATE == 16000)
            I2C_WriteWAU8822(6,  0x1AD);   /* Divide by 6, 16K */
            I2C_WriteWAU8822(7,  0x006);   /* 16K for internal filter coefficients */
        #else
            I2C_WriteWAU8822(6,  0x1ED);   /* Divide by 12, 8K */
            I2C_WriteWAU8822(7,  0x00A);   /* 8K for internal filter coefficients */
        #endif
    }


    I2C_WriteWAU8822(10, 0x008);   /* DAC soft mute is disabled, DAC oversampling rate is 128x */
    I2C_WriteWAU8822(14, 0x108);   /* ADC HP filter is disabled, ADC oversampling rate is 128x */
    I2C_WriteWAU8822(15, 0x0FF);   /* ADC left digital volume control */
    I2C_WriteWAU8822(16, 0x1FF);   /* ADC right digital volume control */

    I2C_WriteWAU8822(44, 0x000);   /* LLIN/RLIN is not connected to PGA */
    I2C_WriteWAU8822(45, 0x090);   /* LAUXIN connected, and its Gain value is 0dB */
    I2C_WriteWAU8822(46, 0x190);   /* RAUXIN connected, and its Gain value is 0dB */
    I2C_WriteWAU8822(47, 0x005);   /* LAUXIN connected, and its Gain value is 0dB */
    I2C_WriteWAU8822(48, 0x005);   /* RAUXIN connected, and its Gain value is 0dB */
    I2C_WriteWAU8822(50, 0x001);   /* Left DAC connected to LMIX */
    I2C_WriteWAU8822(51, 0x001);   /* Right DAC connected to RMIX */

    I2C_WriteWAU8822(52, 0x039);   /* HP Volume */
    I2C_WriteWAU8822(53, 0x139);   /* HP Volume */

    I2C_WriteWAU8822(54, 0x140);   /* LSPKOUT Volume */
    I2C_WriteWAU8822(55, 0x140);   /* RSPKOUT Volume */

    GPIO_SetMode(PE, (1 << 13), GPIO_MODE_OUTPUT);
    PE13 = 0;
    printf("WAU8822 setup ready!\n");
}



void SPI0_IRQHandler(void)
{
    uint32_t u32I2SIntFlag;
    uint32_t i, u32Idx;

    u32I2SIntFlag = SPI0->STATUS;//  I2S_GET_INT_FLAG(I2S, I2S_STATUS_I2STXINT_Msk | I2S_STATUS_I2SRXINT_Msk);

    if(u32I2SIntFlag & SPI_STATUS_TXTHIF_Msk)
    {

        /* Fill 2 word data when it is Tx threshold interrupt */
        for(i = 0; i < 2; i++)
        {
            /* Check buffer empty */
            if((g_u32PlayPos_Out != g_u32PlayPos_In) && g_u8PlayEn)
            {

                /* Check ring buffer trun around */
                u32Idx = g_u32PlayPos_Out + 1;
                if(u32Idx >= BUF_LEN)
                    u32Idx = 0;

                /* Play to I2S */
                SPII2S_WRITE_TX_FIFO(SPI0, g_au32PcmPlayBuf[u32Idx]);

                /* Update OUT index */
                g_u32PlayPos_Out = u32Idx;
            }
            else
            {
                /* Fill 0x0 when buffer is empty */
                SPII2S_WRITE_TX_FIFO(SPI0, 0x00);
                /* Buffer underrun. Disable play */
                g_u8PlayEn = 0;
            }
        }

    }

    if(u32I2SIntFlag & SPI_STATUS_RXTHIF_Msk)
    {
        static int16_t i16Cnt = 0;
        if((g_u32RecPos < 96) && g_u8RecEn)
        {

            g_au32PcmRecBuf[g_u32RecPos  ] = SPII2S_READ_RX_FIFO(SPI0);
            g_au32PcmRecBuf[g_u32RecPos + 1] = SPII2S_READ_RX_FIFO(SPI0);
            g_au32PcmRecBuf[g_u32RecPos + 2] = SPII2S_READ_RX_FIFO(SPI0);
            g_au32PcmRecBuf[g_u32RecPos + 3] = SPII2S_READ_RX_FIFO(SPI0);
            g_u32RecPos += 4;
            if(i16Cnt > 512) i16Cnt = -512;
        }
        else
        {
            SPII2S_READ_RX_FIFO(SPI0);
            SPII2S_READ_RX_FIFO(SPI0);
            SPII2S_READ_RX_FIFO(SPI0);
            SPII2S_READ_RX_FIFO(SPI0);
        }
    }

